# SetPartCustomDataReal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..SetPartCustomDataReal Method
FabricationPart Class See Also
---
Set the custom data real value for the specified custom data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetPartCustomDataReal(
	int customId,
	double value
)
```

Visual Basic
---
```text
Public Sub SetPartCustomDataReal ( _
	customId As Integer, _
	value As Double _
)
```

Visual C++
---
```text
public:
void SetPartCustomDataReal(
	int customId,
	double value
)
```

# ### Parameters
customId
    Type: System..::..Int32 The identifier of the custom data field to set.
value
    Type: System..::..Double The real value of the custom data. If the data is not a real type the value will be parsed according to the fabrication confifuration rules.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The custom data does not exist on the part. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace